Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G52.tmx
Source language: en_us
Languages: zh_cn

source: Linus Torvalds: The King of Geeks (And Dad of 3)
zh_cn: 李纳斯 托沃兹：极客之王（仨娃的爹）

source: THE LICENSE PLATE on Linus Torvalds' Mercedes SLK convertible says it all.
zh_cn: 李纳斯·托沃兹（Linus Torvalds）的梅赛德斯奔驰SLK上的牌照说明了一切。

source: The frame running around the outside of the plate reads "Mr. Linux. King of Geeks."
zh_cn: 罩在车牌外面的牌框上写着“李纳斯先生。极客之王。”

source: But the plate itself says "Dad of 3."
zh_cn: 不过车牌号本身则是“DAD OF 3。”

source: If you meet Linus Torvalds, he comes off as a mild-mannered, down-to-earth Finnish-American.
zh_cn: 如果你碰见李纳斯·托沃兹，他给人的表现是一个温文尔雅、脚踏实地的芬兰裔美国人。

source: He lives with his wife Tove, three kids, a cat, a dog, a snake, a goldfish, a bunny and a pet rat in a comfortable 6,000 square foot home just north of Portland's tony Lake Oswego neighborhood.
zh_cn: 他跟妻子托芙（Tove）、三个孩子、一只猫、一条蛇、一条金鱼、一只兔子还有一只宠物鼠一起生活在波特兰美丽的奥斯威登湖（Lake Oswego）边6000平方英尺的家中。

source: The house is yellow - his favorite color - and so's the Mercedes.
zh_cn: 房子是黄色的，那辆奔驰车也是—黄色是他喜欢的颜色。

source: But he's not really like any of his neighbors.
zh_cn: 不过他跟自己的邻居都不太一样。

source: He drives his Mercedes fast, slamming the car into gear and flooring it.
zh_cn: 他把奔驰车开得飞快，砰地关上门，发动汽车然后就把油门一脚踩到底。

source: There's no coaxing, no hesitation.
zh_cn: 没有锻炼效应，毫不犹豫。

source: Either the hammer is down, or the car is at rest.
zh_cn: 除非油门有问题，或者是车子在休息。

source: And he has an abnormal number of stuffed penguins on his mantle.
zh_cn: 还有就是他家里的火炉罩的上面满是肚子鼓鼓的企鹅，数量多得不同寻常。

source: He leads a double-life. He's the kind of guy who plays poker with the guys for a $20 buy-in every couple of weeks.
zh_cn: 他过着一种双重生活—他是那种每隔几个星期就会跟别人玩买入20美元的扑克游戏的家伙。

source: But at the same time, he in charge of Linux, a truly remarkable open-source software development project that over the past two decades has shaken Microsoft and provided the building blocks for internet giants such as Google, Facebook and Amazon.
zh_cn: 但同时，他还掌管着Linux，一个真正非凡的开源软件开发项目，在过去20年里动摇了微软，并为Google、Facebook和Amazon这样的互联网巨头提供建构模块。

source: Linus Torvalds has reached middle age, and so has Linux.
zh_cn: 李纳斯已人到中年，Linux亦是如此。

source: Nowadays, it's easy to take both of them for granted.
zh_cn: 很容易就会认为这两点都是理所当然。

source: But both are still going strong - very strong.
zh_cn: 但是这两个都还强壮—非常的强壮。

source: Linus still runs the Linux kernel with his unique brand of no-nonsense attitude.
zh_cn: 李纳斯仍然以其独有的严肃态度掌控着Linux的内核。

source: Two weeks ago, he called the makers of SUSE Linux morons because of the operating system's security requirements.
zh_cn: 两个星期之前，他还因为SUSE Linux的安全需求致电给该操作系统制作商的那帮笨蛋。

source: And Linux? It's everywhere.
zh_cn: 至于Linux，它无所不在。

source: Next week, Red Hat will become the first $1 billion open source company.
zh_cn: 下个星期，Red Hat就将成为首家收入达10亿美元的开源公司。

source: Linux began life as an underdog project.
zh_cn: Linux这个项目诞生时并不为人所看好。

source: Torvalds started it while he was a student at the University of Helsinki because he wanted to improve Unix on his Intel 386 computer.
zh_cn: 当托沃兹还是赫尔辛基大学的一名学生时就启动了这个项目，因为他希望在自己的英特尔386计算机上改进Unix。

source: But it soon became an antidote not only to the massive Unix servers built by the likes of Digital Equipment Corp and Sun Microsystems, but to Microsoft's Windows operating system.
zh_cn: 不过Linux不久就变成了一种对抗手段，针对的不仅是那些由DEC（注：后来被Compaq收购，后者随后又被惠普收购）和Sun之类公司开发的Unix服务器，还包括微软的Windows操作系统。

source: Throughout the '90s and on into the next decade, the fight was fierce on both fronts, but now, so many of the battles are won.
zh_cn: 在上个世纪的整个九十年代以及接下来的10年时间里，这两条战线的战争都打得非常激烈，不过现在，赢下的战役已经如此之多。

source: DEC and Sun don't exist anymore.
zh_cn: DEC和Sun不复存在。

source: And Microsoft is playing quite nicely with Linux and other open source tools.
zh_cn: 而微软跟Linux和其他一些开源工具相处得相当不错。

source: Linux isn't the hot-button topic it was once was.
zh_cn: Linux不再像过去那样成为热门话题。

source: It's just plain successful.
zh_cn: 但它四平八稳。

source: More than 8,000 developers have contributed to the Linux kernel in the past seven years, according to the Linux Foundation.
zh_cn: 根据Linux Foundation的说法，过去7年，有超过8000名开发者对Linux内核做出了贡献。

source: And it has even become a standard operating system on custom-built consumer devices.
zh_cn: 它甚至成为了定制消费设备的标准操作系统。

source: You can find it on everything from inflight entertainment systems to streaming video players to Google's Android phones.
zh_cn: 从客舱娱乐系统到流视频播放器，乃至于Google的Adroid手机，你都可以觅到它的踪迹。

source: "It became the plumbing," says Jeremy Allison, a Google engineer who speaks frequently on the topic of open source and is himself a lead developer with another coding project, called Samba.
zh_cn: “它变成了管道设施，”杰里米·埃里森（Jeremy Allison）说。杰里米是Google的一位工程师，他经常讨论开源方面的话题，他本人也是另一个编码项目的首席开发者，该项目的名字叫做Samba。

source: And Linus became a dad.
zh_cn: 李纳斯还成为了一位父亲。

source: But what a dad he is.
zh_cn: 不过这是怎样的一位老爸啊。

source: Linus Torvalds in his kitchen earlier this year.
zh_cn: 李纳斯·托沃兹在自己的厨房（今年初）。

source: Photo: Jon Snyder/Wired
zh_cn: 照片： Jon Snyder/Wired

source: Linus Torvalds Meets Robert Downey, Jr.
zh_cn: 李纳斯遇见小罗伯特·唐尼

source: Red Hat can thank Linus for reaching $1 billion in annual revenue.
zh_cn: Red Hat可以为年度收入到达10亿美元而感谢李纳斯。

source: And Linus can thank Red Hat for his yellow house in Portland.
zh_cn: 而李纳斯则可以为自己在波特兰的黄色房子感谢Red Hat。

source: Prior to its initial public offering in 1999, Red Hat gave Torvalds what turned out to be about $1 million in stock.
zh_cn: 在其1999年首次IPO之前，Red Hat给了李纳斯一笔原来价值百万美元的股票。

source: But Torvalds says that it was his only big Linux payout.
zh_cn: 不过李纳斯说这是他在Linux上面唯一的一笔大的支付。

source: Stock that he was awarded from Transmeta and another Linux startup, VA Systems, wasn't worth very much by the time he was allowed to sell it.
zh_cn: 而他从全美达（Transmeta）等其他Linux初创企业以及VA Systems处所获得的股票，在他被允许售出的时候还不怎么值钱。

source: Still, Torvalds' life is pretty darned good by geek standards.
zh_cn: 尽管如此，按照极客的标准来说，托沃兹的生活过得还是相当的好。

source: He gets paid by the non-profit Linux Foundation to manage the open source software that he loves and - when he wants to - can fly around the world to talk about it.
zh_cn: 他从非盈利的Linux基金会那里获得报酬，让他管理自己喜欢的这个开源软件—只要他愿意，他可以飞遍整个地球去讲这个东西。

source: He has the freedom to pursue his other passion: diving.
zh_cn: 他可以有自由去追求自己的其它酷爱：驾驶。

source: Last week, Torvalds and his friend Dirk Hohndel spent a few days in the 40 degree waters of the Hood Canal, helping to dive-certify six native American geoduck hunters, and Torvalds has even started writing open-source dive-log software.
zh_cn: 上周，托沃兹和他的朋友德克·亨德尔（Dirk Hohndel）在胡德运河40°的水中泡了几天的时间，帮助6位印第安象拔蚌捕手通过潜水认证，托沃兹甚至已经开始动手写开源的潜水记录软件。

source: Last year, Intel invited Torvalds and Tove to a pre-Oscar party in Hollywood, where he rubbed elbows with the likes of Robert Downey Jr., who didn't know who he was, and Mad Men star Jon Hamm, who did.
zh_cn: 去年，英特尔邀请托沃兹和托芙参加一个奥斯卡前夕在好莱坞举行的聚会，他的位置紧挨着不认识他的小罗伯特·唐尼，以及饰演《广告狂人（Mad Men）》的影星乔汉姆（Jon Hamm），他就认识托沃兹。

source: Does he have any regrets?
zh_cn: 他有没有什么遗憾？

source: "Not at all," he says. "Quite the opposite, actually. I'm very happy with feeling that I've done the right thing."
zh_cn: “一点遗憾都没有，”他说：“恰好相反，实际上，我觉得自己完成了恰当的事情，对此我非常高兴。”

source: He adds: "I mean, if I'd started a company, that wouldn't have been because I wanted to start a company.
zh_cn: 他补充道：“我的意思说，如果说我办了一个公司的话，那不会是因为我想要办公司。（译注：意思是说那些成就乃是无心之举）

source: I concentrated on the technical side because that's what I wanted to do."
zh_cn: 我全神贯注地投入到技术方面，因为这才是我想要做的东西。”

source: And that's good news for just about every big internet company, along with the startups that aspire to displace them, because they love to use Linux.
zh_cn: 对于几乎所有大的互联网公司来说，这是个好消息，对于渴望取代他们的初创企业来说亦是如此，因为他们都喜欢使用Linux。

source: Linus Torvalds' mantle.
zh_cn: 李纳斯·托沃兹的炉罩。

source: The Linux Storm
zh_cn: Linux风暴

source: Linux worked because three powerful forces just happened to converge.
zh_cn: Linux之所以受欢迎因为三股强大的势力正好发生交融。

source: First, Linux started just as Intel's processors were getting ready for prime time.
zh_cn: 首先，Linux的开始恰逢英特尔的处理器准备好进入黄金时期。

source: Long before company employees were sneaking iPads and smartphones into the office, there were Linux freaks sneaking Intel machines into corporations to build prototype new programs and build cheap websites and file and print servers.
zh_cn: 在企业员工偷偷摸摸地把iPad和智能手机带进办公室以前很久的时候，Linux就已悄然将英特尔机器带进企业，用来开发新程序原型，以及建设廉价的网站和文件及打印服务器。

source: The second force was the GNU General Public License.
zh_cn: 第二股势力是GNU通用公共许可（General Public License） 。

source: In the 1980s, the Unix makers had done well, but they'd kept a lot of their best technology to themselves.
zh_cn: 在上世纪八十年代，Unix制造商做得很好，但他们把许多最好的技术留给自己。

source: This had been good for business, but in the long run it was bad for Unix.
zh_cn: 这对于做生意来说是好的，但从长远来看对Unix却并非好事。

source: By 1991, there were many incompatible versions of Unix.
zh_cn: 到了1991年，已经出现了许多不兼容的Unix版本。

source: But Linux's license dictated that anybody who made changes had to share them.
zh_cn: 但是Linux的许可则要求任何对其作出变更的人都要共享之。

source: That's kept the project from splitting apart, and it ensured that any really good software gets used by everybody.
zh_cn: 这使得该项目避免了分崩离析，并确保任何真正好的软件都能为人人所用。

source: But the third factor was Torvalds himself, who has put his personal stamp on the Linux in a way that is rare in the open-source world.
zh_cn: 不过第三个因素则是托沃兹本人，他以一种在开源界所罕见的方式将自己的印记烙在Linux上面。

source: When Linus Torvalds moved to the U.S. in the late 1990s, the Linux hype was at its peak.
zh_cn: 上世纪九十年代晚期，当李纳斯搬到美国去的时候，Linux正值巅峰。

source: And Linux's creator was a particularly effective spokesman for the open-source revolution.
zh_cn: Linux的创始人还是开源革命的一位令人特别印象深刻的发言人。

source: He worked for an interestingly secretive chip startup called Transmeta - it fizzled out in the post-dot com implosion - but as long as reporters didn't ask about Transmeta itself, Torvalds was the kind of guy who would speak his mind, apparently unconcerned with who he might happen to piss off.
zh_cn: 他为一家神秘得有趣的芯片初创企业Transmeta工作—在网络泡沫破裂之后这家公司也最终倒闭，但只要记者不问到Transmeta的事情，托沃兹属于那种有话直说的家伙，显然他并不关心自己会不小心惹恼了谁。

source: Torvalds became the perfect foil to the monopolistic, unlikable, Bill Gates.
zh_cn: 托沃兹成为了垄断的、不招人喜欢的比尔?盖茨的完美映衬。

source: He was low key, unassuming, a regular guy who was into computers just for fun.
zh_cn: 前者为人低调、不摆架子，是个纯粹因为乐趣（Just for fun）而喜欢计算机的好人。

source: That was the name of his surprisingly readable autobiography, written in 2002 with journalist David Diamond - a book that Torvalds says he never thinks about today.
zh_cn: 《Just for fun》正是他2002年与记者戴蒙得（David Diamond）合著的自传的名字，自传有趣得令人惊讶—但托沃兹说要是在现在的话他决不考虑。

source: Torvalds is still doing things just for fun.
zh_cn: 托沃兹仍然在为了乐趣而做事。

source: He's a free operator who pulls no punches in technical online discussions, but he's not a blowhard.
zh_cn: 他是一位免费的行家，在技术在线讨论中总是开诚布公、毫无保留，但他不是夸夸其谈的人。

source: It's enough to give him geek credibility, but to keep him from alienating the smart people.
zh_cn: 足以赋予他极客的信誉，但要让他远离那些聪明人。

source: The makers of SUSE Linux know what we're talking about.
zh_cn: SUSE Linux的制造者知道我们在说什么。

source: The Job Offer From Steve Jobs
zh_cn: 乔布斯的工作邀请

source: That passion to make the right design choice is still what drives Torvalds, even as Linux enters its comfortable middle age.
zh_cn: 做出正确的设计选择的那种激情仍旧驱使着托沃兹，哪怕Linux已经进入了自在的中年。

source: "Linus, the person, certainly like all of us, he's gotten older," says Dirk Hohndel, the diving-buddy of Torvalds' who also happens to be chief Linux and open-source technologist at Intel. "But Linus, the god of Linux, has not changed at all.
zh_cn: “李纳斯，这个人，当然跟我们都一样，变得更老了，”托沃兹的潜水伙伴、恰好也是英特尔的Linux和开源技术专家的德克亨德尔说：“但是李纳斯，Linux的上帝，却一点也没有变。

source: He is still the same fiery aggressive, flaming wild, determined true-believer - the person who really knows exactly what he wants."
zh_cn: 还是原来的那个充满闯劲、富有野性、坚决果敢的内心追随者—一个真正懂得自己需要什么的人。”

source: Torvalds may have been a foil to Gates, but Linux's creator probably has more in common with Steve Jobs.
zh_cn: 托沃兹也许一直是盖茨的映衬，不过Linux的创造者可能跟乔布斯的共同点更多。

source: Torvalds leads the Linux project, not so much by writing code, but by arbitrating disputes and making the technical decisions that keep the project moving in the right direction.
zh_cn: 托沃兹领导Linux项目的方式主要不是通过写代码，而是对争端进行仲裁，做出技术决策，让项目朝着正确的方向前进。

source: And that's ability is similar to Jobs' fanatical attention to design detail, says Google's Allison.
zh_cn: Google的阿里森（Allison）说，这种能力类似于乔布斯对设计细节的强烈关注。

source: "Jobs had this wonderful design sense of taste. He created these beautiful products that everybody loved," he says. "Linus has engineering taste, and that's the thing that kind of makes him special.
zh_cn: “乔布斯有着出色的设计味觉他创造出了这些人见人爱的美丽产品，”他说：“Linus则拥有工程感，这正是令其显得特别的东西。

source: He can look at all these potentially competing solutions and cut through the bullshit and say, no this is the right one to choose."
zh_cn: 他能够把这些可能的待选解决方案扫一遍，然后枪毙胡扯的，径直选出合适的。”

source: "He's good at that," Allison adds. "It means he's a dick sometimes, but he's good at it."
zh_cn: “他擅长此事，”阿里森补充道：“这意味着他有时候会妄自尊大，但他的确拿手。”

source: Torvalds has never met Bill Gates, but around 2000, when he was still working at Transmeta, he met Steve Jobs.
zh_cn: 托沃兹从来没有见过盖茨，但是大概在2000年，当他还在Transmeta工作的时候，他会了乔布斯。

source: Jobs invited him to Apple's Cupertino campus and tried to hire him.
zh_cn: 乔布斯邀请他到苹果库比蒂诺（Cupertino）总部，想要雇他。

source: "Unix for the biggest user base: that was the pitch," says Torvalds.
zh_cn: “他的诱饵是最大用户群的Unix，”托沃兹说。

source: The condition: He'd have to drop Linux development.
zh_cn: 条件是：托沃兹必须放弃Linux开发。

source: "He wanted me to work at Apple doing non-Linux things," he said.
zh_cn: “他希望我在苹果工作，从事非Linux的东西，”他说。

source: That was a non-starter for Torvalds.
zh_cn: 对于托沃兹来说这个条件是异想天开。

source: Besides, he hated Mac OS's Mach kernel.
zh_cn: 还有，他讨厌Mac OS的Mach内核。

source: "I said no," Torvalds remembers.
zh_cn: “我说，不，”托沃兹回忆道。

source: Jobs He's Not
zh_cn: 与乔布斯的不同之处

source: But the Jobs-Torvalds analogy breaks down pretty quickly.
zh_cn: 不过这种乔布斯—托沃兹类比瓦解得相当快。

source: Jobs was fabulously wealthy, dated celebrities, and didn't write cute things about his kids on his license plate.
zh_cn: 乔布斯惊人地富有，是过去的名人，他不会在牌照上趣写有关自己孩子的东西。

source: In fact, he didn't even use license plates.
zh_cn: 实际上，他甚至连牌照都不用。

source: And when he had a software problem at Apple, he didn't sit down and write an amazing new program that solved the issue.
zh_cn: 还有，如果他在苹果遇到软件问题的话，他不会坐下来写一段漂亮的新程序来解决问题。

source: Torvalds has done that kind of thing.
zh_cn: 而托沃兹就干过这种事情。

source: On the day Wired visited Torvalds last month, his slightly obsessive attention to detail was on full display.
zh_cn: 上个月《连线》拜访托沃兹的那天，他对细节有点强迫性的关注得到了全景展现。

source: Torvalds quickly invited us in and immediately starting making espresso after espresso in his modern kitchen.
zh_cn: 托沃兹迅速邀请我们进去并马上开始在自家现代化的厨房里一杯接着一杯地弄浓咖啡。

source: His employer, the Linux Foundation, had just bought him a brand new $3,000 Jura espresso maker, and he and his wife Tove were concerned that something is wrong.
zh_cn: 他的雇主，Linux基金会，刚刚为他购买了一台价值3000美元的全新Jura咖啡机，而他和妻子却有点担心，觉得肯定是哪里出问题了。

source: Tove had been complaining about a metallic aftertaste, and Torvalds thought it may be a problem too.
zh_cn: 托芙一直在抱怨有金属味残留，托沃兹也认为有问题。

source: He handed over an espresso, asking: "Do you taste it?"
zh_cn: 他递过来一杯咖啡然后问道：“你尝出来了吗？”

source: To us, the bitter, creamy espresso tasted like it came from a fine coffee shop.
zh_cn: 对于我们而言，这苦涩浓烈的咖啡味道，就像是出自一家上好的咖啡店一样。

source: Torvalds kept making coffees all morning, leaving us jittery and awake as we settled down to talk in the billiard room next to the modest unadorned home office that is the nerve center for Linux.
zh_cn: 整个早上托沃兹都在泡着咖啡，搞得我们坐下来交谈的时候还头脑清醒、神经过敏。我们交谈的地方是台球室，紧挨着朴素未加修缮的家庭办公室—Linux的神经中心。

source: It's above the three-car garage.
zh_cn: 它位于车库的上方。

source: The kind of place where your typical suburban dad would keep his guitar collection and rock out with his buddies over a couple of beers on a Thursday night.
zh_cn: 这种地方是你典型的郊区老爹存放自己的吉他收藏，周二的晚上跟好友喝三两杯啤酒、唱唱摇滚的地方。

source: Instead, Torvalds spends most days here - alone - managing what is surely the most important open-source software project in the planet.
zh_cn: 托沃兹不是这样，相反，他大部分时间都自己一个人呆在这里—管理着无疑是这个星球上最重要的开源软件项目。

source: As Torvalds himself concedes, Linux's stormy days of fighting over big issues are largely behind it.
zh_cn: 正如托沃兹自己承认那样，Linux风雨飘摇的日子基本上已经过去，不再需要为解决大问题而战斗。

source: "I am personally way less open to radical new redesigns," he says. "We've done the radical redesigns to the point where most of the things we do, we do for damned good reason, and doing something radically different would be just stupid."
zh_cn: “我个人不太赞成进行激进的重新设计，”他说：“我们已经发展到了做的大多数事情都有很好的理由，要是做某种完全不同的事情根本就是愚蠢的地步。”

source: Linux hosts an annual event called the Linux Kernel Summit, and to hear Torvalds describe it, it sounds almost like a synod of medieval theologians.
zh_cn: Linux每年都会举办一个名为Linux内核大会（Linux Kernel Summit）的活动，听托沃兹的描述，这个会议似乎就像一场中世纪神学家的宗教会议。

source: "We had the most boring two-hour session on key-signing each others keys," he remembers. "Boy that was not fun."
zh_cn: “我们渡过了最无聊的两小时会议，就是不停地在那里相互为对方的密钥签名认证，”他回忆道：“孩子，那不好玩。”

source: In fact, Linux's creator doesn't really even like to talk about technology.
zh_cn: 实际上，Linux的创建者甚至连技术都不想讨论。

source: He'd rather write.
zh_cn: 他更愿意写。

source: "I think it's so much easier to be very precise in what you write and give code examples and stuff like that," he says. "I actually think it's very annoying to talk technology face-to-face.
zh_cn: “我认为要想很精确的话，书写和给出代码例子之类的东西要（比说）容易得多，”他说：“实际上我认为面对面谈技术是非常讨厌的事情。

source: You can't write down the code."
zh_cn: 你不能写下代码。”

source: He'd rather talk about politics. Or scuba diving. Or the state of the public school system. Or the taste of coffee.
zh_cn: 他更愿意讨论政治，或者潜水运动，或者公立学校体系的现状，或者咖啡的味道也行。
